# LinkedResourceOpeningEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkedResourceOpeningEventArgs Class
Members See Also
---
The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening].
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class LinkedResourceOpeningEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class LinkedResourceOpeningEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class LinkedResourceOpeningEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..LinkedResourceOpeningEventArgs
# See Also
LinkedResourceOpeningEventArgs Members
Autodesk.Revit.DB.Events Namespace